Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: ཞུགས་ནས་དེ་མ་ཐག་ཏུ་ནི། །ཐམས་ཅད་གཞན་དུ་ཕྱོགས་པར་འགྱུར། །ཀླུ་ཡི་རྒྱལ་པོ་རྣམས་ཀྱིས་ནི། །རྨི་ལམ་བསྟན་པ་ཅི་འདྲ་བར། །དེར་ནི་པདྨ་འདྲ་བའི་ཁྲི། །
en: “There the Dharmabhāṇaka should make a seat That is in the form of a lotus Exactly as has been revealed By nāga kings in a dream.

source: དེ་ལྟ་བུར་ཡང་བཤམ་པར་བྱ། །ཁྲི་དེ་ལ་ནི་འདུག་ནས་སུ། །མདོ་སྡེ་འདི་ནི་རབ་ཏུ་བསྟན། །ཡི་གེར་བྲིས་པ་བཀླག་པར་བྱ། །དེ་བཞིན་ཡོངས་སུ་ཆུབ་པར་བྱ། །
en: “Having sat upon that seat, They should teach this sūtra, Write it out, and read it out loud, And similarly, they should learn it.

source: ཁྲི་དེ་ལས་ནི་བབས་ནས་སུ། །ཡུལ་གཞན་སོང་བར་གྱུར་ན་ཡང་། །ཁྲི་དེ་ལ་ནི་ཡོད་པ་ཡི། །ཆོ་འཕྲུལ་རྣམས་ཀྱང་སྣང་བར་འགྱུར། །ཆོས་སྨྲ་བ་ཡི་གཟུགས་སུ་ཡང་། །དེ་ན་རེས་འགའ་སྣང་བར་འགྱུར། །
en: “After they have risen from that seat, Even if they go to another land, Miraculous manifestations Will appear on that seat.

source: རེས་འགའ་སངས་རྒྱས་གཟུགས་སུ་སྟེ། །རེས་འགའ་བྱང་ཆུབ་སེམས་དཔར་ཡང་། །རེས་འགའ་ཀུན་ཏུ་བཟང་པོ་དང་། །དེ་བཞིན་འཇམ་དཔལ་གཟུགས་སུ་སྟེ། །རེས་འགའ་བྱམས་པའི་གཟུགས་སུ་ཡང་། །
en: “Sometimes the form of the Dharmabhāṇaka will appear there, And sometimes the form of a buddha, Sometimes that of a bodhisattva, “Sometimes that of Samantabhadra, Sometimes that of Mañjuśrī, And sometimes that of Maitreya Will appear upon that seat.

source: ཁྲི་དེ་ལ་ནི་སྣང་བར་འགྱུར། །རེས་འགའ་འོད་ནི་འབའ་ཞིག་སྣང་། །
en: “Sometimes only light will appear.

source: རེས་འགའ་ལྷ་རྣམས་སྣང་བར་འགྱུར། །ཡུད་ཙམ་ཞིག་ནི་དེར་སྣང་ནས། །དེ་ནས་མི་སྣང་བར་ཡང་འགྱུར། །
en: Sometimes devas will appear— They will appear there briefly, And then they will disappear.

source: སངས་རྒྱས་མཐོང་ན་བསྔགས་པར་འགྱུར། །
en: “If a buddha is seen, there will be praise.

source: ཐམས་ཅད་དུ་ཡང་གྲུབ་པར་བྱེད། །
en: Everything will be accomplished.

source: དཔལ་ཡོན་བཀྲ་ཤིས་ཕུན་སུམ་ཚོགས། །
en: There will be perfect opulence and good fortune.

source: མཚན་མ་སངས་རྒྱས་སྤྲུལ་པ་ཡིན། །
en: This is an omen emanated by the Buddha.

source: རྒྱལ་དང་དཔལ་དང་གྲགས་པར་བྱེད། །
en: “There will be victory and glory and fame.

source: ཕྱིར་རྒོལ་བ་ཡང་ཟློག་པར་བྱེད། །
en: Those who are adversaries will be repulsed.

source: ཕ་རོལ་དགྲ་ཚོགས་རབ་ཏུ་འཇོམས། །
en: The opposing armies of enemies will defeated.

source: གཡུལ་དུ་དགྲ་རྣམས་ཕུང་བར་བྱེད། །
en: Enemies will be vanquished in battle.

source: རྨི་ངན་ཐམས་ཅད་ཞི་བར་བྱེད། །
en: “All nightmares will come to an end.

source: སྡིག་པ་ཐམས་ཅད་རབ་ཏུ་འཇིག །སྡིག་པ་ཐམས་ཅད་རབ་ཞི་བྱེད། །
en: All bad actions will be eliminated; All bad actions will be brought to an end.

source: གཡུལ་འགྱེད་པ་ན་རྒྱལ་བར་བྱེད། །
en: There will be victory in battle.

source: འཛམ་བུའི་གླིང་འདི་ཐམས་ཅད་དུ། །གྲགས་པས་རབ་ཏུ་གང་བར་འགྱུར། །
en: “One will have fame that will spread Throughout the entirety of this Jambudvīpa.

source: དེ་ཡི་དགྲ་རྣམས་ཐམས་ཅད་ནི། །ཤིན་ཏུ་ཕམ་པ་ཉིད་དུ་འགྱུར། །
en: All the enemies that he has Will be completely defeated.

source: རྟག་ཏུ་དགྲ་ནི་ཆོམས་པར་འགྱུར། །
en: “Enemies will constantly be vanquished.

source: སྡིག་པ་ཐམས་ཅད་རྣམ་པར་སྤངས། །
en: All bad actions will be abandoned.

source: གཡུལ་ངོའི་གདོང་ལས་རྣམ་པར་རྒྱལ། །དགྲ་དང་བྲལ་ཞིང་མཆོག་ཏུ་དགའ། །
en: There will be victory in battle, Freedom from enemies, and perfect joy.

source: ཚངས་དབང་སུམ་ཅུ་རྩ་གསུམ་དབང་། །དེ་བཞིན་འཇིག་རྟེན་སྐྱོང་རྣམས་དང་། །ལག་ན་རྡོ་རྗེ་གནོད་སྦྱིན་དབང་། །རྒྱལ་བ་ཁྱུ་མཆོག་ཡང་དག་ཤེས། །ཀླུ་ཡི་དབང་པོ་མ་དྲོས་དང་། །དེ་བཞིན་དུ་ནི་རྒྱ་མཚོ་དང་། །མི་འམ་ཅི་དབང་ལྷ་མིན་དབང་། །དེ་བཞིན་ནམ་མཁའ་ལྡིང་དབང་པོ། །དེ་དག་ལ་ནི་སོགས་པ་དང་། །ལྷ་རྣམས་དེ་དག་ཐམས་ཅད་ཀྱང་། །ཆོས་ཀྱི་མཆོད་རྟེན་བསམ་ཡས་ལ། །རྟག་ཏུ་མཆོད་པ་བྱེད་པར་འགྱུར། །ཞེ་སར་བཅས་པའི་སེམས་ཅན་རྣམས། །
en: “The Lord of Brahmās, the Lord of Trāyastriṃśa, And similarly the guardians of the world; Vajrapāṇi who is the lord of yakṣas; Saṃjñeya, the supreme victorious leader; “The lord of nāgas, Anavatapta; And likewise Sāgara, The lord of kinnaras and lord of asuras; And also the lord of the garuḍas— “Those and also all such others, Every one of all of the devas— Will constantly make offerings to The inconceivable stūpa of the Dharma, And they will feel great joy on seeing Beings who have reverence.

source: མཐོང་ནས་ཤིན་ཏུ་དགའ་བར་འགྱུར། །ལྷ་ཡི་དབང་པོ་མཆོག་དེ་དག །ཐམས་ཅད་འདི་སྙམ་སེམས་པར་འགྱུར། །ལྷ་རྣམས་དེ་དག་ཐམས་ཅད་ཀྱང་། །ཕན་ཚུན་དུ་ནི་སྨྲ་བྱེད་པ། །
en: “The supreme lords of the devas Will all in their minds be thinking, And every one of the devas Will be saying to one another, “ ‘Look at them, they who have Accumulated merit, glory, and majesty!

source: བསོད་ནམས་དཔལ་དང་གཟི་བརྗིད་དག །བསགས་པ་དེ་དག་ཀུན་ལ་ལྟོས། །གང་དག་མདོ་སྡེ་ཟབ་མོ་འདི། །ཉན་པའི་དོན་དུ་འདིར་ལྷགས་པ། །
en: They have come here To listen to this profound sūtra.

source: མི་དེ་དག་ནི་རབ་སྦྱངས་བའི། །དགེ་བའི་རྩ་བས་འདིར་ལྷགས་སོ། །དད་པ་བསམ་གྱིས་མི་ཁྱབ་པས། །ཆོས་ཀྱི་མཆོད་རྟེན་གུས་དང་བཅས། །
en: “ ‘Those humans who have arrived here Through having developed good roots Have reverence for the stūpa of the Dharma, With a faith that is inconceivable.

source: དེ་དག་འཇིག་རྟེན་སྙིང་རྗེར་ལྡན། །དེ་དག་སེམས་ཅན་ཕན་བྱེད་པ། །
en: “ ‘They have compassion for the world And they bring benefit to beings.

source: དེ་དག་ཟབ་མོའི་ཆོས་རྣམས་ཀྱི། །དམ་པའི་ཆོས་ཀྱི་རོ་ཡི་སྣོད། །
en: They are vessels for the flavor of the sublime Dharma That comes from the profound Dharmas.

source: ཆོས་ཀྱི་དབྱིངས་ལ་འཇུག་པ་ཡིས། །དེ་དག་རབ་ཏུ་འཇུག་པ་ཡིན། །
en: “ ‘They have entered through The entrance to the Dharma realm.

source: གང་དག་གསེར་འོད་དམ་པའི་མདོ། །དགེ་བ་དམ་པ་འདི་ཉན་པས། །དེ་དག་སྔོན་ཆད་སངས་རྒྱས་ནི། །བརྒྱ་སྟོང་རྣམས་ལ་མཆོད་པ་ཡིན། །དགེ་བའི་རྩ་བ་འདི་ཡིས་ནི། །མདོ་འདི་ཉན་པ་དེ་དག་ལ། །ལྷ་དབང་རྒྱལ་པོ་དེ་ཀུན་དང་། །དབྱངས་ཅན་དང་ནི་དེ་བཞིན་དུ། །དཔལ་ལྡན་རྣམ་ཐོས་བུ་དང་ནི། །
en: They who listen to this sublime goodness, The Sūtra of the Sublime Golden Light, “ ‘Have in the past made offerings To a hundred thousand buddhas; It is because of those good roots That they are listening to the sūtra.’

source: དེ་བཞིན་རྒྱལ་པོ་བཞི་རྣམས་དང་། །གནོད་སྦྱིན་བརྒྱ་ཕྲག་སྟོང་པོ་དག །སྟོབས་ཆེན་རྫུ་འཕྲུལ་ལྡན་རྣམས་ཀྱིས། །ཕྱོགས་བཞི་དག་ནི་ཀུན་ནས་ཀྱང་། །སྲུང་བ་ཤིན་ཏུ་བྱེད་པར་འགྱུར། །དབང་པོ་ཟླ་བ་གཤིན་རྗེ་དང་། །རླུང་དང་ཆུ་ལྷ་ཉིད་དང་ནི། །སྐེམ་བྱེད་འཇུག་སེལ་དབྱངས་ཅན་དང་། །
en: “All the lords and kings of devas— Sarasvatī, and similarly Śrī and Vaiśravaṇa, And, similarly, the Four Mahārājas, “And the hundred thousand yakṣas Who have great might and miraculous powers— All of them in the four directions Will give them perfect protection.

source: བསྲེག་བྱ་ཟ་དང་སྐྱེ་དགུ་དང་། །སྟོབས་ཆེན་ཕ་རོལ་གནོན་བྱེད་པ། །འཇིག་རྟེན་སྐྱོང་བ་དེ་ཀུན་ཀྱང་། །ཉིན་མཚན་གཡེལ་བ་མེད་པར་ནི། །དེ་དག་རྣམས་ལ་སྲུང་བར་བྱེད། །སྟོབས་ཆེན་གནོད་སྦྱིན་དབང་གཉིས་དང་། །སྲེད་མེད་བུ་དང་དབང་ཕྱུག་ཆེ། །ཡང་དག་ཤེས་ལ་སོགས་པ་དག །
en: “Indra, Soma, and Yama, Vāyu and Varuṇa, Skanda, Viṣṇu, Sarasvatī, Consumer of Burnt Offerings, and Prajāpati, “Those who with great power subjugate adversaries, All those protectors of the world, Day and night, never inattentive, Will give them their protection.

source: གཞན་ཡང་ཉི་ཤུ་རྩ་བརྒྱད་དང་། །གནོད་སྦྱིན་བརྒྱ་ཕྲག་སྟོང་པོ་དག །སྟོབས་ཆེན་རྫུ་འཕྲུལ་ལྡན་རྣམས་ཀྱིས། །འཇིགས་ཤིང་སྐྲག་པ་ཐམས་ཅད་ལས། །དེ་དག་ལ་ནི་སྲུང་བར་བྱེད། །
en: “The yakṣa lords that have great might— Nārāyaṇa and Maheśvara, Saṃjñeya, and also the rest of The other twenty-eight yakṣas, “And the hundred thousand yakṣas With their great might and miraculous powers— Will give them their protection From all terror and fears.

source: ལག་ན་རྡོ་རྗེ་གནོད་སྦྱིན་དབང་། །གནོད་སྦྱིན་དག་ནི་ལྔ་བརྒྱ་དང་། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱང་། །དེ་དག་ལ་ནི་སྲུང་བར་བྱེད། །གནོད་སྦྱིན་དབང་པོ་ནོར་བུ་བཟང་། །དེ་བཞིན་གང་བ་བཟང་པོ་དང་། །
en: “Vajrapāṇi, the lord of yakṣas, With five hundred yakṣas And all the bodhisattvas, Will give them his protection.

source: ཇི་འཇིགས་དང་ནི་འབྲོག་གནས་དང་། །དམར་སེར་དང་ནི་སེར་སྐྱ་དང་། །གནོད་སྦྱིན་དབང་པོ་རེ་རེ་ཡང་། །གནོད་སྦྱིན་ལྔ་བརྒྱ་དག་གིས་ནི། །གང་དག་མདོ་སྡེ་འདི་ཐོས་པས། །དེ་དག་རྣམས་ལ་སྲུང་བྱེད་འགྱུར། །དྲི་ཟ་སྣ་ཚོགས་སྡེ་དང་ནི། །རྒྱལ་བ་ཁྱུ་མཆོག་རྒྱལ་བའི་རྒྱལ། །ནོར་བུའི་མགུལ་དང་ངེས་མགྲིན་དང་། །དེ་བཞིན་ཆར་པའི་བདག་པོ་དང་། །ཁམ་པོ་ཆེ་དང་ནག་པོ་དང་། །དེ་བཞིན་གསེར་འདྲའི་སྐྲ་དང་ནི། །ལྔས་རྩེན་དང་ནི་ར་རྐང་དང་། །
en: “Maṇibhadra, the lord of yakṣas, And similarly, Pūrṇabhadra, Kumbhīra and Aṭavika, Piṅgala and Kapila— “Each of those lords of yakṣas, Accompanied by five hundred yakṣas— Will give their protection to Those who listen to this sūtra.

source: དེ་བཞིན་སྐལ་བ་ཆེན་པོ་དང་། །ཡུར་བ་ཅན་དང་ཆོས་སྐྱོང་དང་། །སྤྲེའུ་དང་དེ་བཞིན་འཁྲི་བྱེད་དང་། །ཁབ་ཀྱི་སྤུ་དང་གཉེན་བཤེས་དང་། །དེ་བཞིན་རིན་ཆེན་སྐྲ་དང་ནི། །ཡུལ་ཆེན་ཅན་དང་ཁྱིམ་མེད་དང་། །འདོད་པའི་མཆོག་དང་ཙནྡན་དང་། །མཐུ་བོ་ཆེ་དང་གངས་ཅན་དང་། །བདེ་བའི་རི་ཉིད་དེ་བཞིན་ཏེ། །སྟོབས་ཆེན་ཕ་རོལ་གནོན་བྱེད་པ། །རྫུ་འཕྲུལ་ལྡན་པ་དེ་ཀུན་ཀྱང་། །གང་དག་མདོ་སྡེ་འདི་དགའ་བ། །དེ་དག་ལ་ནི་སྲུང་བར་བྱེད། །ཀླུ་ཡི་དབང་པོ་མ་དྲོས་དང་། །དེ་བཞིན་དུ་ནི་རྒྱ་མཚོ་དང་། །
en: “Gandharva and Citrasena, Jinarāja and Jinarṣabha, Maṇikaṇṭha and Nikaṇṭha, And similarly Varṣādhipati; “Mahāgrāsa and Mahākāla, And similarly also Svarṇakeśin, Pāñcika, and Chagalapāda, And similarly also Mahābhāga; “Praṇālin and Mahāpāla, Markaṭa and also Vāli, Sūciroma and Sūryamitra, And similarly Ratnakeśa; “Mahāpraṇālin and Nakula, Kāmaśreṣṭha and Candana, Nāgāyana and Haimavata, And similarly Sātāgiri— “All of them, who have great might, Subjugate adversaries, and have miraculous power— Will give their protection to Those who listen to this sūtra.

source: ཨེ་ལའི་འདབ་དང་བཏང་བཟུང་དང་། །དགའ་བོ་ཉེ་དགའ་གཉིས་ཀ་དང་། །ཀླུ་ནི་བརྒྱ་ཕྲག་སྟོང་པོ་དག །སྟོབས་ཆེན་རྫུ་འཕྲུལ་ལྡན་རྣམས་ཀྱིས། །འཇིགས་ཤིང་སྐྲག་པ་ཐམས་ཅད་ལས། །དེ་དག་ལ་ནི་སྲུང་བར་བྱེད། །སྟོབས་ཆེན་སྒྲ་གཅན་མི་གཏོང་དང་། །ཐགས་ཟངས་རིས་དང་བདེ་མཆོག་དང་། །
en: “The nāga lord Anavatapta, And similarly Sāgara, Both Elapatra and Mucilinda, And Nanda and Upananda, “With a hundred thousand nāgas With great might and miraculous powers, Will give them their protection From all terrors and fears.

source: རབ་ཚིམ་བྱེད་དང་ཕྲག་རྩུབ་དང་། །དེ་བཞིན་ལྷ་མིན་དབང་གཞན་དང་། །ལྷ་མིན་བརྒྱ་ཕྲག་སྟོང་པོ་དག །སྟོབས་ཆེན་རྫུ་འཕྲུལ་ལྡན་རྣམས་ཀྱིས། །འཇིགས་སྐྲག་བྱུང་བར་གྱུར་པ་ལས། །དེ་དག་ལ་ནི་སྲུང་བར་འགྱུར། །
en: “Bali, Rāhu, and Namuci, Vemacitra and Saṃvara, Prahrāda and Kharaskandha, And similarly the other lords of asuras, “With a hundred thousand asuras With great might and miraculous powers, Will give them their protection From all terrors and fears.

source: འབྱུང་པོའི་མ་མོ་འཕྲོག་མ་ནི། །ལྔ་བརྒྱའི་བུ་དང་བཅས་པ་ཡང་། །འདུག་དང་ཉལ་དང་ར་རོའི་ཚེ། །དེ་དག་ལ་ནི་སྲུང་བར་བྱེད། །གདོལ་པ་མོ་དང་གཏུམ་མོ་དང་། །དེ་བཞིན་གནོད་སྦྱིན་གཏུམ་མོ་དང་། །
en: “Hārītī, the mother of spirits, With her five hundred children, Will give them their protection While they sit, sleep, or are intoxicated.

source: དུང་ཅན་དང་ནི་སོ་བརྩེགས་དང་། །སེམས་ཅན་ཀུན་གྱི་གཟི་འཕྲོག་མ། །སྟོབས་ཆེན་ཕ་རོལ་གནོན་བྱེད་པ། །རྫུ་འཕྲུལ་ལྡན་པ་དེ་ཀུན་ཀྱང་། །ཕྱོགས་བཞི་དག་ནི་ཀུན་ནས་སུ། །དེ་དག་རྣམས་ལ་སྲུང་བར་བྱེད། །དབྱངས་ཅན་དག་ལ་སོགས་པ་རྣམས། །ལྷ་མོ་བསམ་གྱིས་མི་ཁྱབ་དང་། །
en: “Caṇḍā and Caṇḍālikā, And similarly the yakṣiṇī Caṇḍikā, Conch Shell, and Kūṭadantī, And also Yakṣiṇī Thief of All Beings’ Splendor— “All of them, who have great might, Subjugate adversaries, and have miraculous power— Will give their protection to them Everywhere in the four directions.

source: དཔལ་ལ་སོགས་པ་དེ་བཞིན་དུ། །ལྷ་མོ་དག་ནི་ཐམས་ཅད་དང་། །ས་ཡི་ལྷ་མོ་ཉིད་དང་ནི། །ལོ་ཐོག་འབྲས་བུ་ནགས་ལྷ་དང་། །ཀུན་དགའ་ཤིང་ལྗོན་མཆོད་རྟེན་ལ། །གནས་པ་དག་དང་རླུང་ལྷ་དང་། །ལྷ་རྣམས་དེ་དག་ཐམས་ཅད་འདིར། །རབ་ཏུ་དགའ་བའི་སེམས་ཀྱིས་ནི། །གང་དག་མདོ་སྡེ་འདི་དགའ་བ། །
en: “Sarasvatī and all the other Countless numbers of goddesses, And similarly Śrī and All of the other goddesses— “The goddess of the earth and The goddesses of harvests, fruits, and forests; Those who dwell in parks, trees, and caityas; And the goddesses of the wind— “Every one of those goddesses, With their minds filled with joy, Will here give their protection To those who delight in this sūtra.

source: དེ་དག་རྣམས་ལ་སྲུང་བར་བྱེད། །ཚེ་དང་མདོག་དང་སྟོབས་རྣམས་ལ། །སེམས་ཅན་དག་ནི་སྦྱོར་བར་བྱེད། །དཔལ་དང་བསོད་ནམས་གཟི་བརྗིད་ཀྱི། །ཕུན་སུམ་ཚོགས་པས་རྟག་ཏུ་བརྒྱན། །
en: “They will bestow on those beings Life and color and strength, And will constantly adorn them with perfect Glory and merit and magnificence.

source: གཟའ་དང་རྒྱུ་སྐར་གནོད་པ་དག །དེ་དག་ཐམས་ཅད་ཞི་བར་བྱེད། །
en: “They will end all harm from The planets and the lunar asterisms.

source: རྒུད་དང་སྡིག་དང་རྨི་ངན་པ། །དེ་དག་ཐམས་ཅད་ཞི་བར་བྱེད། །
en: They will bring to an end all troubles, Bad actions, and nightmares.

source: ཟབ་ཅིང་སྟོབས་ཆེན་ལྡན་པ་ཡི། །ས་ཡི་ལྷ་མོ་ཉིད་ཀྱང་ནི། །གསེར་གྱི་འོད་ཀྱི་དམ་པ་ཡི། །མདོ་སྡེའི་དབང་པོའི་རོ་ཡིས་ཚིམ། །
en: “The goddess of the earth herself, Who has depth and great strength, Will be satiated by the flavor of The Lord King of Sūtras, The Sublime Golden Light.

source: དཔག་ཚད་དག་ནི་བརྒྱ་ཡི་ཕྲག །སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་ནས། །རྡོ་རྗེའི་གདན་ལ་ཐུག་བར་དུ། །ས་ཡི་བཅུད་ནི་རབ་ཏུ་འཕེལ། །
en: “For sixty-eight thousand Times a hundred yojanas, As far down as the vajra foundation, The fertility of the earth will increase.

source: དཔག་ཚད་བརྒྱར་ནི་ཚང་བ་ཡི། །འོག་ཏུ་ས་ཡི་བཅུད་སོང་སྟེ། །དེ་ནི་ཕྱིར་ཡང་ལོག་ནས་སུ། །ས་ཡི་སྟེང་དག་སྣུམ་པར་བྱེད། །
en: “The fertility of the earth that has sunk A whole hundred yojanas below Will rise back upward And enrich the surfaces.

source: མདོ་འདི་མཉན་པའི་སྟོབས་ཀྱིས་ནི། །ལྷ་རྣམས་དེ་དག་ཐམས་ཅད་ཀྱང་། །གསེར་གྱི་འོད་ནི་དམ་པ་ཡི། །མདོ་སྡེའི་དབང་པོའི་རོས་ཚིམ་འགྱུར། །
en: “Every one of all those devas, through The power of listening to the sūtra, Will be satiated by the flavor of The Lord King of Sūtras, The Sublime Golden Light.

source: གཟི་བྱིན་ལྡན་པར་རབ་འགྱུར་ཞིང་། །དེ་བཞིན་རབ་ཏུ་སྟོབས་ལྡན་འགྱུར། །
en: “They will become perfectly brilliant, And similarly they will have strength.

source: བདེ་བར་འགྱུར་ཞིང་ཚིམ་པར་འགྱུར། །
en: They will be happy and satisfied.

source: འཛམ་བུའི་གླིང་འདི་ཐམས་ཅད་ན། །འབྲས་བུ་ལོ་ཐོག་ནགས་ལྷ་རྣམས། །སྣ་ཚོགས་རོ་ཡིས་ཚིམ་འགྱུར་ཞིང་། །ཤིན་ཏུ་རབ་ཏུ་དགའ་བར་འགྱུར། །མདོ་འདིའི་རོ་ཡིས་ཚིམ་གྱུར་ནས། །
en: Throughout the entirety of Jambudvīpa, “The devas of fruits, harvests, and forests Will be satisfied by various flavors, And they will be completely delighted, Satisfied by the flavor of the sūtra.

source: འབྲས་བུ་རྣམས་དང་ལོ་ཐོག་དང་། །མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་དང་། །འབྲས་བུའི་ཤིང་ལྗོན་སྣ་ཚོགས་ཀྱང་། །ཀུན་ནས་རབ་ཏུ་སྐྱེ་བར་བྱེད། །
en: “Then the fruits and the harvests, And the various kinds of flowers And the various kinds of fruit trees, Will all develop perfectly.

source: འབྲས་བུའི་ཤིང་ལྗོན་ཐམས་ཅད་དང་། །ཀུན་དགའ་དག་དང་ནགས་ཚལ་རྣམས། །མེ་ཏོག་རབ་ཏུ་འཆག་བྱེད་ཅིང་། །སྣ་ཚོགས་དྲི་ནི་རབ་ཏུ་འབྱིན། །
en: “All the fruit trees, The parks, and the forests Will blossom with flowers Emitting their various aromas.

source: མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་དང་། །འབྲས་བུ་སྣ་ཚོགས་ལྡན་པ་ཡི། །རྩ་དང་ནགས་ཚལ་ཐམས་ཅད་དག །ས་ཡི་སྟེང་ན་སྐྱེ་བར་བྱེད། །
en: “All the plants and trees That have various kinds of flowers And various kinds of fruits Will grow upon the earth.

source: འཛམ་བུའི་གླིང་འདི་ཐམས་ཅད་ན། །ཀླུ་ཡི་བུ་མོ་བསམ་མི་ཁྱབ། །རབ་ཏུ་དགའ་བའི་སེམས་གྱུར་ནས། །རྫིང་བུའི་དྲུང་དུ་ཉེར་སོང་སྟེ། །
en: “Throughout the entirety of this Jambudvīpa There will be innumerable nāga maidens Whose minds will become filled with joy, And they will come to where the ponds are.

source: རྫིང་བུ་རྣམས་ནི་ཐམས་ཅད་དུ། །ཀུ་མུ་ད་དང་པདྨ་དང་། །ཨུཏྤ་ལ་དང་དེ་བཞིན་དུ། །པདྨ་དཀར་པོ་སྣ་ཚོགས་སྐྱེ། །
en: “And there will grow in all the ponds A variety of night lotuses, Red lotuses, and similarly Blue lotuses and white lotuses.

source: ནམ་མཁའ་ལ་ནི་དུ་བ་དང་། །སྤྲིན་གྱི་དྲ་བ་མེད་ཅིང་དག །
en: “In the sky there will be no smoke, And it will not be covered by clouds.

source: མུན་པ་དང་ནི་རྡུལ་མེད་ཅིང་། །ཕྱོགས་རྣམས་རབ་ཏུ་འོད་གསལ་ལོ། །
en: There will be no darkness and no dust, And everywhere will be completely bright.

source: ཉི་མ་འོད་ཟེར་སྟོང་ལྡན་ཡང་། །འོད་ཟེར་དྲ་བས་འོད་ཀྱང་འགྱེད། །སྣང་བ་དག་ནི་ཟབ་མོ་ཡིས། །རབ་ཏུ་དགའ་བ་འཆར་བར་འགྱུར། །
en: “A bright and beautiful net of light rays That has a thousand rays of sunlight Brings the most perfect joy With its profound brightness.

source: དབང་པོ་ཉི་མ་ལྷ་ཡི་བུ། །འཛམ་བུའི་གླིང་གི་གསེར་གྱི་ནི། །གཞལ་མེད་ཁང་ན་འདུག་པ་ཡང་། །མདོ་སྡེ་འདིས་ནི་རབ་ཏུ་ཚིམ། །
en: “Even that lord, the deva Sūrya, Dwelling in his divine palace Made of Jambū River gold, Will gain satisfaction through this sūtra.

source: དབང་པོ་ཉི་མ་རབ་དགའ་ནས། །འཛམ་བུའི་གླིང་དུ་འཆར་བྱེད་ཅིང་། །འོད་ཟེར་མཐའ་ཡས་དྲ་བ་ཡིས། །ཀུན་ནས་རབ་ཏུ་སྣང་བར་བྱེད། །
en: “When Lord Sūrya is gladdened, He will shine onto Jambudvīpa; He will completely illuminate it With an infinite net of light rays.

source: དེ་ནི་ཤར་བ་ཙམ་གྱིས་ཀྱང་། །འོད་ཟེར་དྲ་བ་རབ་གཏོང་ཞིང་། །རྫིང་བུ་སྣ་ཚོགས་ཁེངས་པ་ཡི། །པདྨ་དག་ནི་ཁ་ཡང་འབྱེད། །
en: “Simply through his rising, He will shine a net of light rays, And the lotuses that fill A variety of ponds will open.

source: འཛམ་བུའི་གླིང་འདི་ཐམས་ཅད་དུ། །མེ་ཏོག་འབྲས་བུ་སྨན་སྣ་ཚོགས། །ཡང་དག་ཡོངས་སུ་སྨིན་བྱེད་ཅིང་། །ས་རྣམས་ཐམས་ཅད་སིམ་པར་བྱེད། །
en: “Throughout the entirety of this Jambudvīpa, The various flowers, fruits, and herbs Will perfectly, completely ripen, And the entire earth will be satisfied.

source: ཟླ་བ་དང་ནི་ཉི་མ་ཡང་། །དེ་ཚེ་ཁྱད་འཕགས་སྣང་བར་འགྱུར། །
en: “The moon and the sun also Will at that time be brighter.

source: རྒྱུ་སྐར་ཡང་དག་འབྱུང་འགྱུར་ཞིང་། །རླུང་ཡང་དེ་བཞིན་ལྡང་བར་འགྱུར། །
en: The lunar asterisms will move perfectly, And similarly so will the winds.

source: འཛམ་བུའི་གླིང་ནི་ཐམས་ཅད་དུ། །ཀུན་ཏུ་ལོ་ཡང་ལེགས་འགྱུར་ཏེ། །
en: “Throughout all of Jambudvīpa There will be excellent harvests.

source: གང་ན་མདོ་སྡེ་འདི་ཡོད་པ། །ཡུལ་འཁོར་དེར་ནི་ཁྱད་པར་འཕགས། །
en: Wherever this sūtra is present, That kingdom will be preeminent.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། གནོད་སྦྱིན་གྱི་གནས་ཞེས་བྱ་བ་ཀུན་ཏུ་སྲུང་བའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་རྩ་གཉིས་པའོ།། །།དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། །བཅོམ་ལྡན་འདས་ལ་རིགས་ཀྱི་ལྷ་མོ་བྱང་ཆུབ་ཡང་དག་པར་བསྡུས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་འབར་བའི་ཁྱད་པར་གྱི་གཟི་བརྗིད་ཀྱི་རྒྱལ་པོ་ལ་སོགས་པ།
en: This concludes “The Protection Given by Yakṣas,” the twenty-second chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: ལྷའི་བུ་ཁྲི་པོ་དག་རྒྱུ་གང་དང་། རྐྱེན་གང་དང་། དགེ་བའི་རྩ་བ་སྦྱངས་པ་ཅི་འདྲ་བ་དང་། གང་བགྱིས་ཤིང་བསགས་པས། སྐྱེས་བུ་དམ་པ་གསུམ་པོ་འདི་དག་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཐོས་ནས། ད་ལྟར་སུམ་ཅུ་རྩ་གསུམ་གྱི་གནས་ནས་ལྷགས་ཏེ། བཅོམ་ལྡན་འདས་ལ་ཆོས་ཉན་པའི་སླད་དུ་མཆིས་ཏེ།
en: Chapter 23: The Prophecy to Ten Thousand Devas When the Bhagavat had said that, the noble goddess Bodhisattvasamuccayā asked him, “Venerable Bhagavat, through what cause and what condition, and through what accomplishment and accumulation of planting good roots, have Jvalanāntara­tejo­rāja and these other ten thousand devas now come from the Trāyastriṃśa paradise, having heard the prophecy to these three sublime beings?

source: འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག །སྐྱེས་བུ་དམ་པ་འདི་མ་འོངས་པའི་དུས་ན། བསྐལ་པ་བགྲང་བ་ལས་འདས་པ་གྲངས་མ་མཆིས་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་གསེར་དུ་སྣང་ཞེས་བྱ་བར། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: “It was thus: this excellent being, the bodhisattva Ruciraketu, in a future time, after many hundreds of thousands of quintillions of asaṃkhyeyas of eons have passed, will attain the highest, most complete enlightenment of buddhahood in the world realm Suvarṇaprabhā.

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། །བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གསེར་དང་རིན་པོ་ཆེའི་འབྱུང་གནས། གདུགས་བརྩེགས་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་འབྱུང་ངོ་། །ཇི་ཙམ་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་དང་རིན་པོ་ཆེའི་འབྱུང་གནས་གདུགས་བརྩེགས་པ་དེ།
en: He will appear in that world as the tathāgata arhat samyaksaṃbuddha, the one with wisdom and virtuous conduct, the sugata, the one who knows the world’s beings, the unsurpassable guide who tames beings, the teacher of devas and humans, the buddha, the bhagavat by the name of Suvarṇa­ratnākaracchatra­kūṭa.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དམ་པའི་ཆོས་ནུབ་སྟེ། དེའི་བསྟན་པ་ཡོང་ཡེ་ཐམས་ཅད་དུ་ནུབ་པར་གྱུར་པ་ན། ཁྱེའུ་དངུལ་གྱི་ཏོག་འདི་དེ་བཞིན་གཤེགས་པ་དེའི་མཚམས་སྦྱོར་ཞིང་། འཇིག་རྟེན་གྱི་ཁམས་རྡུལ་མེད་པའི་རྒྱལ་མཚན་དེ་ཉིད་དུ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་འཛམ་བུའི་གསེར་གྱི་རྒྱལ་མཚན་གྱི་འོད་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་འབྱུང་ངོ་། །ཇི་ཙམ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་འཛམ་བུའི་གསེར་གྱི་རྒྱལ་མཚན་གྱི་འོད་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས། དེའི་བསྟན་པ་ཡོང་ཡེ་ཐམས་ཅད་དུ་ནུབ་པའི་བར་དུ་གྱུར་པ་ན།
en: “When the tathāgata arhat samyaksaṃbuddha Suvarṇa­ratnākaracchatra­kūṭa has passed into nirvāṇa and his Dharma has come to an end and his teachings have completely come to an end, at that time, this boy by the name of Rūpyaketu will appear as the tathāgata arhat samyaksaṃbuddha by the name of Suvarṇa­jambu­dhvaja­kāñcanābha in the world realm called Virajadhvajā.

source: ཁྱེའུ་དངུལ་གྱི་འོད་འདི་དེ་བཞིན་གཤེགས་པ་དེའི་མཚམས་སྦྱོར་ཞིང་། འཇིག་རྟེན་གྱི་ཁམས་རྡུལ་དང་བྲལ་བའི་རྒྱལ་མཚན་དེ་ཉིད་དུ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གསེར་བརྒྱའི་འོད་ཟེར་དུ་སྣང་བའི་སྙིང་པོ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་འབྱུང་ངོ་ཞེས་དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ཀྱིས།
en: “When the tathāgata arhat samyaksaṃbuddha Suvarṇa­jambu­dhvaja­kāñcanābha has passed into nirvāṇa and his Dharma has come to an end and his teachings have completely come to an end, then this boy, by the name of Rūpyaprabha, will be the successor of that tathāgata, attaining the highest enlightenment of complete buddhahood in the world realm called Immaculate Banner, appearing as the tathāgata arhat samyaksaṃbuddha, the one with wisdom and virtuous conduct, the sugata, the one who knows the world’s beings, the unsurpassable guide who tames beings, the teacher of devas and humans, the buddha, the bhagavat by the name of Essence of the Radiance of a Hundred Golden Lights.

source: དེ་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །
en: “All of that was the Bhagavat’s prophecy of their attainment of the highest, most complete enlightenment.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རིགས་ཀྱི་ལྷ་མོ་བྱང་ཆུབ་ཡང་དག་པར་བསྡུས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་འབར་བའི་ཁྱད་པར་གྱི་གཟི་བརྗིད་ཀྱི་རྒྱལ་པོ་ལ་སོགས་པ་ལྷའི་བུ་ཁྲི་པོ་དེ་དག་ནི་དེ་ཙམ་དུ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རླབས་པོ་ཆེར་ཡང་མ་གྱུར།
en: Then the noble goddess Bodhisattvasamuccayā said to the Bhagavat, “Venerable Bhagavat, Jvalanāntara­tejo­rāja and the rest of those ten thousand devas have not had such a great, extensive bodhisattva conduct as that.

source: སྔོན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ལ་སྤྱད་སྐད་ཀྱང་མི་གདའ། ལག་པ་དང་། རྐང་པ་དང་།
en: “It is not said that they have previously practiced the six perfections.

source: མིག་དང་། ཡན་ལག་གི་དམ་པ་མགོ་དང་། བུ་དང་། ཆུང་མ་དང་། བུ་མོ་ཕངས་པ་དག་སྔོན་ཡོངས་སུ་བཏང་སྐད་ཀྱང་མི་གདའ། ནོར་དང་། འབྲུ་དང་། འགྲོན་བུ་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་ཌཱུརྱ་དང་། དུང་དང་།
en: “It is not said that they have previously given away their arms, legs, eyes, the supreme limb of the head, or their beloved sons, wives, and daughters.

source: མན་ཤེལ་དང་། བྱི་རུ་དང་། དངུལ་དང་། ས་ལེ་སྦྲམ་དང་། རིན་པོ་ཆེ་རྣམས་སྔོན་ཡོངས་སུ་བཏང་སྐད་ཀྱང་མི་གདའ། །བཟའ་བ་དང་། བཏུང་བ་དང་། བཞོན་པ་དང་། གོས་དང་། མལ་ཆ་དང་། སྟན་དང་།
en: “It is not said that they have previously given away wealth, grain, cowries, gold, silver, jewels, pearls, beryl, conchs, crystals, coral, silver, or gold nuggets.

source: ཁང་ཁྱིམ་དང་། གཞལ་མེད་ཁང་དང་། ཀུན་དགའ་ར་བ་དང་། རྫིང་བུ་དང་། ལྡེང་ཀ་དག་སྔོན་ཡོངས་སུ་བཏང་སྐད་ཀྱང་མི་གདའ།
en: “It is not said that they have previously given away food, drink, steeds, clothes, beds, seats, houses, divine palaces, parks, ponds, or pools.

source: གླང་པོ་ཆེ་དང་། བ་ལང་དང་། རྟ་ཕོ་རྒོད་དང་། བྲན་ཕོ་དང་། བྲན་མོ་སྣ་ཚོགས་སྔོན་ཡོངས་སུ་བཏང་སྐད་ཀྱང་མི་གདའ།
en: “It is not said that they have previously given away elephants, oxen, stallions, male servants, or female servants.
